/*
 * FILT_upd.cpp
 *
 *  Created on: Mar 26, 2014
 *      Author: butters
 */

//////////////////////////////////////////////////////////
/*	
 *	Функция обновления фильтра H
 *
 *	Входные параметры:
 *		Mat& H1, 
 *		Mat& H2			-	компоненты фильтра H
 *		Mat& H1_n,
 *		Mat& H2_n		-	обновленные компоненты фильтра H
 *		double& alfa	-	коеффициент альфа-смешивания	
 */
//////////////////////////////////////////////////////////

/* Includes */
//////////////////////////////////////////////////////////
#include <opencv2/opencv.hpp>
#include "opencv2/highgui/highgui.hpp"

using namespace cv;
using namespace std;
//////////////////////////////////////////////////////////

/* Тело функции обновления компонент фильтра H */
//////////////////////////////////////////////////////////
void FILT_upd(Mat& H1, Mat& H2, Mat& H1_n, Mat& H2_n, 
	double& alfa)
{
	H1 = H1*(1 - alfa) + H1_n*alfa;
	H2 = H2*(1 - alfa) + H2_n*alfa;
}
//////////////////////////////////////////////////////////